/*** FAST3.C*********PCA高速輸出中斷範例************
*動作：CEX0(P12)及CEX1(P13)高速輸出有時間差的兩個方波
*硬體：低頻SW1-4(P1LED)
***********************************************/
#include "..\MPC82.H"   //暫存器及組態定義
//Fosc=22.1184MHz，PCA計數時脈=Fosc/12=1.8432MHz
#define T  14400  //PCA延時時間=(1/1.8432MHz)*14400=7812.5uS
main()         
{
  PCON2=7; //Fosc=Fosc/128，PCA延時時間=7812.5uS*128=1秒
  CCAPM0 = CCAPM1 =ECOM+MAT+TOG+ECCF; //MAT=1，PAC計數與CCAP0匹配時，令CCF0=1
                              //ECOM=1，致能比較器功能
					          //TOG=1，(CH:CL)=CCAP0時，令CEX0腳反相
						      //ECCF=1，致能有匹配(CCF0=1)時，產生中斷
  CCAP0L=T;	CCAP0H=T>>8;        //設定T送入CEX0比較暫存器
  CCAP1L=T<<1; CCAP1H=(T<<1)>>8;//設定T*2送入CEX1比較暫存器

  EA = 1;       //致能所有中斷
  AUXIE = EPCA; //致能PCA中斷
  CCF0 = 0;		//清除模組0的比較旗標
  CR = 1;       //啟動PCA計數 
  while(1);	    //空轉,等待(CH:CL)=CCAP0產生中斷
}
/***********************************************************
*函數名稱: PCA中斷函數
*功能描述: 自動令CEX0反相
************************************************************/
void PCA_Interrupt() interrupt 10
{
  if(CCF1==1) CL=CH=0; //若是CEX1中斷，PCA計數器由0開始上數
  CCF0=CCF1= 0; //清除模組0-1的比較旗標
}