/******* PCA2.C*********PCA溢位中斷範例********
*動作：由PCA計數溢位中斷進行延時，令SPEAK(P10)反相輸出
*硬體：高頻SW2-5(SPK)ON,低頻SW1-4(P1LED)ON
***********************************************/
#include "..\MPC82.H"   //暫存器及組態定義
//Fosc=22.1184MHz，PCA計數時脈=Fosc/12=1.8432MHz
#define T  14400  //PCA延時時間=(1/1.8432MHz)*14400=7812.5uS
main()         
{
  PCON2=7; //Fosc=Fosc/128，PCA延時時間=7812.5uS*128=1秒
  CMOD=ECF;       //致能PCA溢位中斷，PCA計數時脈來源=Fosc/12
 //CMOD=ECF+CPS0; //致能PCA溢位中斷，PCA計數時脈來源=Fosc/2

  CL= (65536-T) % 256; //將低8-bit計數值存入CL 
  CH= (65536-T) / 256; //將高8-bit計數值存入CH
  EA = 1;              //致能所有中斷
  AUXIE = EPCA;        //致能PCA中斷
  CR=1;       //啟動PCA計數
  while(1);   //自我空轉
}
/***********************************************************
*函數名稱: PCA中斷函數
*功能描述: 自動令CEX0反相
************************************************************/
void PCA_Interrupt() interrupt 10
{
   SPEAK=!SPEAK;         //SPEAK反相
   CL= (65536-T) % 256; //將低8-bit計數值存入CL 
   CH= (65536-T) / 256; //將高8-bit計數值存入CH
   CF=0;          //若計時CF=1，清除PCA溢位旗標CF=0 
}