/******* PCA3.C*********PCA溢位中斷範例********
*動作：PCA計數時脈來源為Timer0的PCA計數溢位中斷延時
*      ，令SPEAK(P10)反相輸出
*硬體：高頻SW2-5(SPK)ON,低頻SW1-4(P1LED)ON
***********************************************/
#include "..\MPC82.H"   //暫存器及組態定義
//Fosc=22.1184MHz，PCA計數時脈=Fosc/12=1.8432MHz
#define T  14400  //PCA延時時間=(1/1.8432MHz)*14400=7812.5uS
main()         
{
  CMOD=ECF+CPS1;  //致能PCA溢位中斷，CPS1-0=10,設定由Timer0溢位時脈提供PCA計數
	
  TMOD=0x02; //設定使用Timer0的mode2(8-bit自動載入)
  TH0=256-128; //設定PCA計數時脈來源,PCA延時時間=128*7812.5uS=1秒
  TR0=1;  	 //開始Timer0計時

  CL= (65536-T) % 256; //將低8-bit計數值存入CL 
  CH= (65536-T) / 256; //將高8-bit計數值存入CH
  EA = 1;              //致能所有中斷
  AUXIE = EPCA;        //致能PCA中斷
  CR=1;       //啟動PCA計數
  while(1);   //自我空轉
}
/***********************************************************
*函數名稱: PCA中斷函數
*功能描述: 自動令CEX0反相
************************************************************/
void PCA_Interrupt() interrupt 10
{
   SPEAK=!SPEAK;         //SPEAK反相
   CL= (65536-T) % 256; //將低8-bit計數值存入CL 
   CH= (65536-T) / 256; //將高8-bit計數值存入CH
   CF=0;          //若計時CF=1，清除PCA溢位旗標CF=0 
}