/********** Timer2_5.c ****************************
*動作：設定以Timer2計時中斷，若是計時溢位令LED遞加，溢位重新載入
*      若T2EX(P11)腳輸入負緣觸發令LED=0，強迫重新載入
*硬體：P32連接T2EX(P11)，SW1-3(P0LED)ON，按KEY1(P32)
**********************************************/
#include "..\MPC82.H"   //暫存器及組態定義
               //Fosc=22.1184MHz，Timer時脈=Fosc/12=1.8432MHz
#define T  57600  //Timer延時時間=(1/1.8432MHz)*57600=31250uS

unsigned char i=0;	
main()
  {
   P0M0=0; P0M1=0xFF; //設定P0為推挽式輸出(M0-1=01)
   //PCON2=5; //Fosc=Fosc/32，時間=31250uS*32=1秒(軟體模擬無效)
   T2CON = 0x08; /* 0000 1000，由T2EX腳輸入負緣觸發會重新載入
                    bit3:EXEN2=1,使用外部T2EX接腳
			        bit1:C/T=0,內部計時 
			        bit0:CP/RL2=0,重新載入*/
   RCAP2=T2R=65536-T; //設定Timer2及T2自動載入暫存器
   TR2 = 1;         //啟動Timer2開始計時
   EA=1;ET2=1;      //致能Timer2中斷
   while (1);       //自我空轉，表示此時可作其它工作
  }
//*****************************************************
 void T2_int (void) interrupt 5   //Timer2中斷函數
  {
   if (TF2 ==1)  //若是計時溢位令LED遞加，溢位重新載入
     {
       TF2=0;    //清除TF2=0
       LED=~i++; //LED遞加輸出
     }
   else  //若是T2EX腳輸入負緣觸發令LED=0，強迫重新載入
     {
       EXF2=0;   //清除EXF2=0
       i=0;      //i=0
	   LED=~i;
     }  
 }
