/********** Timer2_6.C ****************************
*動作：令Timer2由T2CKO(P10)輸出方波
*硬體：高頻SW2-5(SPK)ON,低頻SW1-4(P1LED)ON
**********************************************/
#include "..\MPC82.H"  //暫存器及組態定義
                //T2CKO頻率=Fosc/4/(65536-T2)
#define T 43200 //T2CKO頻率=22118400/4/43200=128Hz			    
main()          
{
  PCON2=7;	//Fosc=Fosc/128，T2CKO頻率=128Hz/128=1Hz
  T2CON=0x00; /* 0000 0000，設定為內部計時，溢位重新載入
                 bit3:EXEN2=0,不使用外部T2EX接腳
			     bit1:C/T2=0,內部計時 */
  RCAP2=T2R=65536-T; //設定Timer2及重新載入時間
  TR2=1;        //啟動Timer2開始計時
  T2MOD=T2CKOE; //致能T2CKO(P10)輸出方波
  while (1);    //自我空轉，表示此時可作其它事情
}		
