/********** Timer2_1.c **********************************
*動作：SPEAK反相輸出，設定Timer2做延時動作溢位重新載入
*硬體：高頻SW2-5(SPK)ON,低頻SW1-4(P1LED)ON
********************************************************/
#include "..\MPC82.H"   //暫存器及組態定義
                  //Fosc=22.1184MHz，Timer時脈=Fosc/12=1.8432MHz
#define T  57600  //Timer延時時間=(1/1.8432MHz)*57600=31250uS
main()         
{
  PCON2=5; //Fosc=Fosc/32，延時時間=31250uS*32=1秒(軟體模擬無效)
  T2CON=0x00; /* 0000 0000，設定為內部計時，溢位重新載入
                 bit3:EXEN2=0,不使用外部T2EX接腳
			     bit1:C/T2=0,內部計時 */
  RCAP2=T2R=65536-T; //設定Timer2及重新載入時間
  TR2=1;      //啟動Timer2開始計時
  while (1)   //不斷循環執行
   {
     SPEAK=!SPEAK;  //SPEAK反相輸出
     while(TF2==0); //等待Timer2計時溢位，若TF2=0自我循環
     TF2=0; //若計時溢位TF2=1，RCAP2自動重新載入T2，清除TF2=0
   }
}
