/********** UART4.c ********MODE1串列中斷範例****************
*動作：電腦UART送出字元，由RXD腳以中斷接收，在LED顯示, 同時發射回去
*硬體：SW1-3(P0LED)、SW3-3(TxD1)及SW3-4(RxD1)ON
***********************************************************/
#include "..\MPC82.H"   //暫存器及組態定義
main()
{
  UART_init(9600); //設定串列環境及鮑率
  EA=1;ES=1;  //致能串列中斷
  while(1);   //自我空轉，表示可做其它工作
}
//***********************************************************
void SCON_int (void)  interrupt 4  //串列中斷函數 
 {
   if(RI==1)  //若是因為接收所產生的中斷
    { 
	  RI=0;       //接收完畢，令RI=0
      LED=~SBUF;  //將接收到的字元由LED輸出
      SBUF=~LED;  //將接收到的資料，發射回去
	}
   else TI=0; //若是因為發射所產生的中斷，令TI=0
 }
/***********************************************************
*函數名稱: UART_init
*功能描述: UART啟始程式
*輸入參數：bps
************************************************************/
void UART_init(unsigned int bps)  //UART啟始程式
{  P0M0=0; P0M1=0xFF; //設定P0為推挽式輸出(M0-1=01)
   SCON=0x50;     //設定UART串列傳輸為MODE1及致能接收
   TMOD=0x20;     //設定TIMER1為MODE2
   TH1=256-(57600/bps);  //設計時器決定串列傳輸鮑率
   TR1=1;          //開始計時
}