/********** UART6.c *********串列埠函數發射****************
*動作：用printf()函數將資料以UART串列格式送到電腦
*硬體：SW3-3(TxD1)ON
***********************************************************/
#include "..\MPC82.H"   //暫存器及組態定義
#include <stdio.h>   //加入標準輸出入函數
main()
{  
  int i=42,j=3;       //定義整數變數
  char  ch='a';       //定義字元變數
   
  UART_init(9600);     //設定串列環境及鮑率
  TI=1;
  printf("i=%d \n",i);      //顯示i=42
  printf("j= %d \n",j); 	//顯示j=3
  printf("i=%d,j=%d,i+j=%d \n\n",i,j,i+j);//顯示i=42,j=3,i+j=45
   
  printf("%d --> %%d-->/%d/\n",i,i);//42 --> %d-->/42/
  printf("%d --> %%6d-->/%6d/\n",i,i);//42 --> %6d-->/    42/
  printf("%d --> %%06d-->/%06d/\n",i,i); //42 --> %06d-->/000042/
  printf("%d --> %%-6d-->/%-6d/\n\n",i,i);  //42 --> %-6d -->/42    /
  
  printf("i(8)= %o\n",i);	 //顯示i(8)=52
  printf("i(16)= %x\n\n",i); //顯示i(16)=2a
     
  printf("%c --> %%c-->/%c/\n",ch,ch);//a --> %c-->/a/
  printf("%c --> %%6c -->/%6c/\n",ch,ch);//a --> %c-->/     a/
  printf("%c --> %%-6c-->/%-6c/\n",ch,ch);//a --> %c-->/a     / 
  while(1);   //自我空轉
}
/***********************************************************
*函數名稱: UART_init
*功能描述: UART啟始程式
*輸入參數：bps
************************************************************/
void UART_init(unsigned int bps)  //UART啟始程式
{  P0M0=0; P0M1=0xFF; //設定P0為推挽式輸出(M0-1=01)
   SCON = 0x50;     //設定UART串列傳輸為MODE1及致能接收
   TMOD = 0x20;     //設定TIMER1為MODE2
   TH1 = 256-(57600/bps);  //設計時器決定串列傳輸鮑率
   TR1 = 1;          //開始計時
}