/********** UART8.C ********串列埠函數接收*****************
*動作：電腦UART送出字元，由getchar()函數接收，在LED0顯示
*                        由getkey()函數接收，在LED1顯示
*硬體：SW1-3(P0LED)、SW1-4(P1LED)SW3-3(TxD1)及SW3-4(RxD1)ON
***********************************************************/
#include "..\MPC82.H"   //暫存器及組態定義
#include <stdio.h>      //加入標準輸出入函數
main()
{
  UART_init(9600); //設定串列環境及鮑率
  TI=1;
  while(1)    //不斷循環執行
   { 
     LED0=~getchar(); //等待按鍵，由串列埠輸入字元到LED0及畫面顯示
     putchar('\n');   //跳行
     LED1=~getkey();  //等待按鍵，由串列埠輸入字元到LED1顯示
     putchar('\n');   //跳行
  }
}
/***********************************************************
*函數名稱: UART_init
*功能描述: UART啟始程式
*輸入參數：bps
************************************************************/
void UART_init(unsigned int bps)  //UART啟始程式
{  P0M0=0; P0M1=0xFF; //設定P0為推挽式輸出(M0-1=01)
   SCON = 0x50;     //設定UART串列傳輸為MODE1及致能接收
   TMOD = 0x20;     //設定TIMER1為MODE2
   TH1 = 256-(57600/bps);  //設計時器決定串列傳輸鮑率
   TR1 = 1;          //開始計時
}