/*************** 6_4.c ****************************
*動作：設定Timer1為mode1及外部計數，
*      由P10輸出脈波，送到T1(P35)腳作為外部計數，
*      P10反相20次，輸入10個脈波後，才令LED遞加。
*硬體：P10連接P35腳，SW1-3(P0LED)ON，SW1-4(P1LED)ON
***************************************************/
#include "..\MPC82.H"   //暫存器及組態定義
#define T  10  //T0計數10次，設定輸入脈波數
main()
{
   unsigned char i=0;
   P0M0=0; P0M1=0xFF; //設定P0為推挽式輸出(M0-1=01)
   TMOD=0x50; /*0101 0000,設定Timer1為mode1外部計數
                bit7:GATE=0,不使用INT1腳啟動計時
			    bit6:C/T=1,外部計數
			    bit5-4:MODE=01，mode1 */
  while(1)   //不斷循環執行
   {
      LED=~i++;  //令LED遞加
	  TL1=65536-T;      //將低8位元計數值存入TL1
      TH1=(65536-T)>>8; //將高8位元計數值存入TH1
      TR1=1;            //啟動Timer1
      while(TF1==0)	  //若TF1=0，等待P10反相20次，令計數溢位
      {
	      P1_0=!P1_0; //P10反相 ，送到T1(P35)
	      Delay_ms(500);
	   }
     TF1=0;  //若計數溢位TF1=1，清除TF1=0 
  }
}
