/********** 6_6A.c ***************************
*動作：以Timer0計時中斷mode1、定時令喇叭反相輸出
*硬體：高頻SW2-5(SPK)ON,低頻SW1-4(P1LED)ON
**********************************************/
#include "..\MPC82.H"   //暫存器及組態定義
                  //Fosc=22.1184MHz，Timer時脈=Fosc/12=1.8432MHz
#define T  57600  //Timer延時時間=(1/1.8432MHz)*57600=31250uS
unsigned char i=0;
main()         
{
  P0M0=0; P0M1=0xFF; //設定P0為推挽式輸出(M0-1=01)
  //PCON2=5; //Fosc=Fosc/32，時間=31250uS*32=1秒(軟體模擬無效) 
  
  TMOD = 0x01; /*0000 0001，設定Timer0為mode1內部計時
                 bit3:GATE=0,不使用外部INT0接腳
  		         bit2:C/T0=0,內部計時 
			     bit1-0:MODE=01,使用模式1工作*/
  TL0=65536-T; TH0=(65536-T)>>8; //設定Timer0計數值
  EA=1;ET0=1;    //致能Timer0中斷
  TR0=1;         //啟動Timer0開始計時
  while(1);      //自我空轉，表示此時可作其它事情
}
/************************************************************/
void T0_int(void) interrupt 1  //Timer0中斷函數
  {
    TL0=65536-T; TH0=(65536-T)>>8; //重新設定Timer0計數值
	i++;
	if(i>31)  {SPEAK = !SPEAK; i=0;}    //喇叭反相輸出
  }
