/********** 6_7.c ******mode3中斷實習*********
*動作：設定以Timer0、mode3進行中斷延時動作
*硬體：高頻SW2-5(SPK)或SW2-6(SPK)ON，低頻SW1-4(P1LED)ON 
***************************************************/
#include "..\MPC82.H"   //暫存器及組態定義
               //Fosc=22.1184MHz，Timer時脈=Fosc/12=1.8432MHz
#define T10  225  //TL0延時時間=(1/1.8432MHz)*225=122.0703125uS
#define T12  112  //TH0延時時間=(1/1.8432MHz)*112=60.76uS

main()
{
  PCON2=7;// TH0時間=67.8uS*128=7777.7uS(軟體模擬無效)
           //TL0時間=122.0703125uS*128=15625uS
  TMOD = 0x03;  /*0000 0011，設定Timer0為mode3內部計時
                  bit3:GATE=0,不使用INT0腳啟動計時
			      bit2:C/T=0,內部計時
			      bit1-0:MODE=11，mode3 */
  TL0=255-T10;      //設定TL0計數值
  TH0=T12;           //設定TH0計數值
  EA=1; ET0=1 ;ET1=1;//致能Timer0及Timer1中斷
  TR0=1;           //啟動TL0計時
  TR1=1;           //啟動TH0計時
  while (1);       //不斷循環執行
}
/************************************************************/
void T0_int(void) interrupt 1  //Timer0中斷函數
  {
    TL0=255-T10;  //重新設定TL0計數值
	P1_0=!P1_0;   //P10反相輸出
    TF0=0;    
  }
/************************************************************/
void T1_int(void) interrupt 3  //Timer1中斷函數
  {
    TH0=T12;      //重新設定TH0計數值
	P1_2=!P1_2;   //P12反相輸出
	TF1=0;
  }
