//************* calendar1A.c *************************************
//動作：以Timer2計時中斷，在LCD顯示電子鐘時、分、秒
//      按KEY1分遞加，按KEY2時遞加
//*************************************************************
#include "..\MPC82.H"   //暫存器及組態定義
                  //Fosc=22.1184MHz，Timer時脈=Fosc/12=1.8432MHz
#define T  57600  //Timer延時時間=(1/1.8432MHz)*57600=31250uS
 unsigned char dly_sec=32; //設定計時重覆次數，時間=31250uS*32=1秒
 unsigned char hor=13,min=32,sec=55;  //設定時、分秒初值	

main()
{
   EA=1; ET2=1; //致能Timet2計時溢位中斷
   T2CON=0x00; //設定為內部計時，溢位重新載入
   RCAP2=T2R=65536-T; //設定Timer2及重新載入時間
   TR2=1;      //啟動Timet2
   					    
   LCD_init();           //重置及清除LCD 

   while(1)	  //開始顯示及計算萬年曆
   {	
   	  LCD_Cmd(0x80);	//顯示第一行位置
      LCD_Data(hor/10+'0');LCD_Data(hor%10+'0'); //顯示時
      LCD_Data(':');
           
	  LCD_Data(min/10+'0');LCD_Data(min%10+'0'); //顯示分
      LCD_Data(':');
    
      LCD_Data(sec/10+'0'); LCD_Data(sec%10+'0');//顯示秒
	  
	  if(P3_2==0) { min++; Delay_ms(1000);}  //按KEY1分遞加
	  if(P3_3==0) { hor++; Delay_ms(1000);}	 //按KEY2時遞加
	  if(min > 59) {min=0; hor++;}    
	  if(hor > 23) hor=0;    
      
	  if (sec < 60) continue; //若秒小於60到while(1)處   
      sec=0; min++;           //秒等於60則令秒=0，分加一
	  if (min < 60) continue; //若分小於60到while(1)處   
      min=0; hor++;           //若分等於60則令分=0，時加一
      
	  if (hor <24)  continue; //若時小於24到while(1)處
      hor=0; min=0; sec=0;    //若時等於24則令時、分、秒=0 
  }
}
/*******************************************************/ 
void T2_int(void) interrupt 5  //Timet2中斷函數
{
  dly_sec--;	        //計時重覆次數遞減
  if(dly_sec==0)        //若秒時間到
   {sec++; dly_sec=32;} //秒遞加及重覆次數(設中斷點)
   TF2=0;    //清除TF2=0
}
/***********************************************************
*函數名稱: LCD_Data
*功能描述: 傳送資料到文字型LCD
*輸入參數：dat
************************************************************/
void LCD_Data(char dat)  //傳送資料到LCD
{
    Data=dat; //資料送到BUS
    RS=1;RW=0;EN=1;//資料寫入到LCD內
    Delay_ms(1);   //LCD等待寫入完成
    EN=0;          //禁能LCD    
}
/***************************************************************
*函數名稱: LCD_Cmd
*功能描述: 傳送命令到文字型LCD
*輸入參數：Cmd
************************************************************/
void LCD_Cmd(unsigned char Cmd) //傳送命令到LCD
{
    Data=Cmd;  //命令送到BUS
    RS=0;RW=0;EN=1; //命令寫入到LCD內
    Delay_ms(1);    //LCD等待寫入完成     
    EN=0;           //禁能LCD
}
/***************************************************************
*函數名稱: LCD_init
*功能描述: 啟始化文字型LCD
*****************************************************************/
void LCD_init(void)    //LCD的啟始程式  
{
    LCD_Cmd(0x38);/*0011 1000,8bit傳輸,顯示2行,5*7字型
                    bit4:DL=1,8bit傳輸,
                    bit3:N=1,顯示2行
                    bit2:F=0,5*7字型*/    
    LCD_Cmd(0x0c);/*0000 1100,顯示幕ON,不顯示游標,游標不閃爍
                    bit2:D=1,顯示幕ON
                    bit1:C=0,不顯示游標
	                bit0:B=0,游標不閃爍*/
    LCD_Cmd(0x06);/*0000 0110,//顯示完游標右移,游標移位禁能 
                    bit1:I/D=1,顯示完游標右移,
                    bit0:S=0,游標移位禁能*/  
    LCD_Cmd(0x01); //清除顯示幕  
    LCD_Cmd(0x02); //游標回原位  
}
