/********** fre3.c ***********************************
*動作：設定Timer0及Timer1的mode2計時中斷，令P10
*      及P12輸出指定的頻率
*硬體：SW2-5(SPK)ON或SW2-6(SPK)ON
******************************************************/
#include "..\MPC82.H"   //暫存器及組態定義
#define  F0   4000          //定義F0輸出頻率=4KHz
#define  F1   8000          //定義F1輸出頻率=8KHz
#define  T    22118400/12/2 //T=Fosc/12/2=基本頻率 
#define  t0   256-T/F0      //F0計時器內容 
#define  t1   256-T/F1		//F1計時器內容
main()
{
 EA=1;ET0=1;ET1=1; //致能Timer0及Timer1計時中斷
 PT1=1;            //致能較高頻的Timer1中斷優先
 TMOD=0x22;        //設定Timer0-1為mode2  
 TH0=t0; TH1=t1;   //設定Timer0-1計時值
 TR0=1;  TR1=1;    //啟動Timer0-1開始計時
 while(1);         //空轉，等待計時溢位
}
/******************************************/
void T0_int(void) interrupt 1  //Timer0中斷函數
{ P1_0 = !P1_0; }    //P10反相輸出
/********************************************/
void T1_int(void) interrupt 3  //Timer1中斷函數
{ P1_2 = !P1_2; }    //P12反相輸出

