/********** Timer2_2.c *****************************
*動作：設定Timer2為外部計數，
*      由P12輸出脈波，送到T2(P10)腳作為外部計數，
*      P12反相20次，輸入10個脈波後，才令LED遞加。
*硬體：P12連接P10腳,SW1-3(P0LED)ON,SW1-4(P1LED)ON
************************************************/
#include "..\MPC82.H"   //暫存器及組態定義
#define T  10  //T0計數10次，設定輸入脈波數
main()
{
  unsigned char i=0;
  P0M0=0; P0M1=0xFF; //設定P0為推挽式輸出(M0-1=01)
  C_T2=1;            // C/T2=1外部計數
  RCAP2=T2R=65536-T; //設定Timer2及重新載入計數值
  TR2=1;             //啟動Timer2開始計數
  while (1)          //不斷循環執行
   {
     LED=~i++;     //LED遞加
     while(TF2==0)//等待外部計數10次，若TF2=0表示未溢位自我循環
      {
        P1_2=!P1_2; 	//P12反相，送到T2(P10)
	    Delay_ms(500);	   
      }
     TF2=0; //若計時溢位TF2=1，RCAP2自動重新載入T2，清除TF2=0
  }
}
