 /********** Timer2_3.c ******************************
*動作：若是計時溢位令LED0遞加，並重新載入
*      若是T2EX(P11)腳輸入負緣觸發，令LED0=0，強迫重新載入
*硬體：P32連接P11(T2EX)腳，SW1-3(P0LED)及SW1-4(P1LED)ON
*      按KEY1(P32)，產生T2EX腳輸入負緣觸發
*********************************************************/
#include "..\MPC82.H"   //暫存器及組態定義
               //Fosc=22.1184MHz，Timer時脈=Fosc/12=1.8432MHz
#define T  57600  //Timer延時時間=(1/1.8432MHz)*57600=31250uS
main()         
{
  unsigned char i=0;
  PCON2=5; //Fosc=Fosc/32，時間=31250uS*32=1秒(軟體模擬無效) 
  P1=0xFF;
  T2CON=0x08;/* 0000 1000，由T2EX腳輸入負緣觸發會重新載入
                bit3:EXEN2=1,致能外部T2EX接腳
			    bit1:C/T2=0,內部計時 
			    bit0:CP/RL2=0,重新載入*/
 RCAP2=T2R=65536-T; //設定Timer2及重新載入時間
 TR2=1;
 while (1)    //不斷循環執行
  {
    if(TF2==1)   //若是計時溢位LED遞加，並重新載入
     {
       LED=~i++;   //LED遞加
       TF2=0;    //清除TF2=0
     }  
    if(EXF2==1)  //若是T2EX腳輸入負緣觸發，清除令LED
     {
       i=0; LED=~i; // 清除LED0
       EXF2=0;     //清除EXF2=0 
     }  
   }
}
