/********** WDT.C ****看門狗計時器*****************************
*動作：使用WDT看門狗計時器，若延時太長，來不及將WDT清除，
*	   會令程式不斷重置，無法進行LED遞加輸出
*硬體：SW1-3(P0LED)ON
**************************************************************/
#include "..\MPC82.H"   //暫存器及組態定義
 			   //WDT時間=Fosc/12/WDT除頻/32768
#define Div  2 //Div=0~7=WDT除頻2~256倍,若WDT除頻=8倍 
main()		   //WDT時間=22118400/12/8/32768=7Hz=142mS
{
  unsigned char i=0;
  P0M0=0; P0M1=0xFF; //設定P0為推挽式輸出(M0-1=01)
  while(1)
   {
	  WDTCR = ENW+Div; //致能WDT計時，設定WDT除頻 
	  Delay_ms(200);   //延時若超過WDT時間，會不斷的重置 
	  WDTCR=CLRW;      //WDT重新計時
	  LED=~i++;        //LED遞加	  
	}
}
