/********** 4_4.C ****************************
*動作：由KEY1按鍵開關輸入具防止機械彈跳，令LED遞加輸出
*硬體：SW1-3(P0LED)ON, 按KEY1 
***********************************************/
#include "..\MPC82.H"   //暫存器及組態定義 
main() 
{
   unsigned char i=0;
   P0M0=0; P0M1=0xFF; //設定P0為推挽式輸出(M0-1=01)
   while(1) //重覆執行 
   {
	LED=~i++;   //LED遞加
	do
	  {
		while(KEY1==1);//若未按鍵，KEY1=1空轉
		Delay_ms(1);   //若有按鍵，延時避開機械跳動
	  }
	 while(KEY1 == 1);//延時後，若KEY1仍為1，跳到do重新檢查
	    
	 do
	  {
		while(KEY1==0);//若未放鍵，KEY1=0空轉
		Delay_ms(1);  //若有放鍵，延時避開機械跳動
	  }
	 while(KEY1== 0); //延時後，若KEY仍為0，跳到do重新檢查
   }
} 