/********** RYG1.c *****************************
*動作：令LED輸出紅黃綠燈的變化
*硬體：SW1-3(P0LED)ON
***********************************************/
#include "..\MPC82.H"   //暫存器及組態定義
char code light[]=   //紅黃綠燈的變化資料
{ 0x21,0x01,0x21,0x01,0x21,0x01,0x21,0x11,
  0x0C,0x08,0x0C,0x08,0x0C,0x08,0x0C,0x0A};

char code time[] =   //每一個變化的時間
{30,1,1,1,1,1,1,4,30,1,1,1,1,1,1,4};

main()
{
  char i;   //資料計數
  P0M0=0; P0M1=0xFF; //設定P0為推挽式輸出(M0-1=01)
  while(1)  //永久循環執行
   {
     for(i=0;i<sizeof(light);i++) //設定0~15個變化
      {        
       LED=light[i];  //紅黃綠燈資料由LED輸出
       Delay_ms(time[i]*200);//將每一個變化的時間送到延時函數
      }
  }
}