/*******************SEG1.C***********************
*動作：送出數碼資料到a~g，令共陽極七段顯示器顯示0~F
*接線：Data=七段顯示器低電位輸出=Pgfedcba
*      低電位掃描：S3~0=千、百、十、個位數
*硬體：SW1-1(SEG7)ON
************************************************/
#include "..\MPC82.H"   //暫存器及組態定義
 unsigned char code Table[] //七段顯示器0~F數碼資料
  ={0x3f,0x06,0x5b,0x4f,0x66,0x6d,0x7d,0x07,
    0x7f,0x6f,0x77,0x7c,0x39,0x5e,0x79,0x71}; 
void main() 
{
  char i;  //資料計數
  P0M0=0; P0M1=0xFF; //設定P0為推挽式輸出(M0-1=01)
  S0=0;    //令單個七段顯示器亮
  while(1) //重覆執行
   {
    for(i=0;i<16;i++) //計數=0~15
     {
       Data=~Table[i];//讀取顯示器數碼資料低電位輸出
       Delay_ms(500);  //延時  
     }
   }
}