/********************** 4_3.c *******************
*動作：由按鍵控制喇叭音頻，按KEY1增加,若按KEY2減少延時時間
*硬體：SW2-5(SPK)ON, 按KEY1及KEY2控制音頻 
***********************************************/
#include "..\MPC82.H"   //暫存器及組態定義
main() 
{
 unsigned int dly,i=1000;
 P1M0=0;    P1M1=0x01; //設定P10(SPK)為推挽式輸出(M0-1=01
 while(1)  //重覆執行
 {
   if(KEY1==0) {
       i++;	             //若按KEY1則加長延時
      if(i>65500) i=65500;   //限制最長時間
               }
   if(KEY2==0) { 
    i--;	   //若按KEY2則縮短延時
   if(i<100)  i=100;   //限制最短時間
    }
   dly=i; while(dly--); //改變延時
   SPEAK=!SPEAK;   //SPEAK反相,令喇叭發出聲音
  }
}