/***** DOT2A.c ******8*8點矩陣固定字型範例*****
*動作：輸出陣列字型資料，顯示上下鏡射的字型
*接線：Scan低電位掃描輸出，由Data低電位輸出資料
*硬體：SW1-2(LED8X8)ON
************************************************/
#include "..\MPC82.H"   //暫存器及組態定義
#include "font.h"  //字型資料檔
main() 
{ 
  unsigned char  i,j; //定義陣列資料計數
  Scan=0x7F;       //由com1開始掃瞄輸出  
  while(1)		  
  {
    for(i=0;i<8;i++)   //讀取8筆資料掃瞄8次
     {
       j=font[i];   //將字型陣列資料讀出，放入位元定址區 j 中
       P0_0 = j & 0x80; //P0_0<--j(7)     
       P0_1 = j & 0x40; //P0_1<--j(6)
       P0_2 = j & 0x20; //P0_2<--j(5)
       P0_3 = j & 0x10; //P0_3<--j(4)
       P0_4 = j & 0x08; //P0_4<--j(3)
       P0_5 = j & 0x04; //P0_5<--j(2)
       P0_6 = j & 0x02; //P0_6<--j(1)
       P0_7 = j & 0x01; //P0_7<--j(0)       
       Delay_ms(1);    //延時
       Data=0xFF;      //全暗	       
       Scan=RR8(Scan); //換掃瞄下一行
   } 
  }
} 