/*********** SEG5.C ***********************************
*動作：手動控制步進馬達運轉，同時在七段顯示器顯示步數 
*接線：Data=七段顯示器低電位輸出=Pgfedcba
*      低電位掃描：S3~0=千、百、十、個位數                            
*      矩陣式按鍵(0)P20=控制正反轉，1=正轉，0=反轉。
*      矩陣式按鍵(1)P21=控制運轉/停止，1=運轉，0=停止
*      矩陣式按鍵(2)P22=控制加速，1=不變，0=加速
*      矩陣式按鍵(3)P23=控制減速，1=不變，0=減速
*硬體：SW1-1(SEG7)及SW2-1~4(STEP)ON,按鍵(0)~(3)
******************************************************/
#include "..\MPC82.H"   //暫存器及組態定義
code char run_Table[] = {0x01,0x02,0x04,0x08}; //步進馬達驅動數碼 
code unsigned char Table[] //七段顯示器0~9數碼資料
={0x3f,0x06,0x5b,0x4f,0x66,0x6d,0x7d,0x07,0x7f,0x6f};
int step=0;  //步進馬達行進步數=0
void Display(char scan); //七段顯示器顯示步數
void main()
{
  int scan=100; //四位數七段顯示器掃描次數
  char  i=0;  //步進馬達驅動數碼計數=0
  P0M0=0; P0M1=0xFF; //設定P0為推挽式輸出(M0-1=01)
  P1M0=0; P1M1=0xF0; //設定P17-4(STEP)為推挽式輸出(M0-1=01)
  STEP=0x0f;    //步進馬達輸出=0  
  P2_4=0;  //選擇按鍵(0)~(3)
  while(1) 
   {
    Display(scan);     //七段顯示器顯示步數
    while(P2_1==0) Display(scan); //若P21=0停止運轉，掃描顯示器
	if(P2_0==1)          //若P21=1，P20=1，馬達正轉
     {
      if(i>3) i=0;     //若資料計數>3，從0開始
      STEP=run_Table[i]<<4; //讀取驅動數碼由STEP輸出 
      i++; step++;     //資料計數+1及步數+1
      if(step > 9999) step=0;
     }
    else               //若P21=1，P20=0，馬達反轉
    {
      if(i<0) i=3;     //若資料計數<0，從3開始
      STEP=run_Table[i]<<4; //讀取驅動數碼由STEP輸出  
      i--; step--;     //資料計數-1及步數-1 
      if(step < 0) step=9999;
    }

	if(P2_2==0){scan--;if(scan< 10) scan=10;}//P22=0加速，限制加速
	if(P2_3==0){scan++;if(scan > 999) scan=999;}//P23=0減速，限制減速
  }
}
//***************************************************	 
void Display(char scan) //四位數七段顯示器顯示步數	 
{  
  unsigned char i; //七段顯示器數碼資料計數
  while(scan--) //重覆掃描次數 
   {
     S0=S1=S2=S3=1; //遮沒
     i=step % 10;   //取出個位數
     Data=~Table[i]; //讀取個位數碼資料輸出
     S0=0;        //選擇個位數顯示器
     Delay_ms(1);    //掃描延時  
       
     S0=S1=S2=S3=1; //遮沒           
     i=(step % 100)/10; //取出十位數 
     Data=~Table[i];//讀取十位數碼資料輸出
     S1=0;       //選擇十位數顯示器
     Delay_ms(1);   //掃描延時
                            
     S0=S1=S2=S3=1; //遮沒
     i=(step % 1000)/100; //取出百位數
     Data=~Table[i]; //讀取百位數碼資料輸出
     S2=0;       //選擇百位數顯示器
     Delay_ms(1);    //掃描延時
       
     S0=S1=S2=S3=1; //遮沒
     i=step/1000;  //取出千位數
     Data=~Table[i]; //讀取千位數碼資料輸出
     S3=0;        //選擇千位數顯示器
     Delay_ms(1);    //掃描延時
   } 
}
