/***********3_35.c ********************************
*動作：由LED0-1輸出16-bit的左右移動作
*硬體：SW1-3(P0LED)及SW1-4(P1LED)ON
************************************************/
#include "..\MPC82.H"  //暫存器及組態設定
main() 
{
  unsigned int  i=0x0001; //定義整數
  P0M0=0; P0M1=0xFF; //設定P0為推挽式輸出(M0-1=01)
  while(1)    //重覆執行 
   {
     while(i<0x8000)   //判斷是否移到最左邊 
     {
       LED0=~i;       //低位元組輸出
       LED1=~(i>>8);  //高位元組輸出
       Delay_ms(100); //延時
       i=i << 1 ;     //資料左移
     }               
     while(i >0x0001)  //判斷是否移到最右邊
      {
        LED0=~i;       //低位元組輸出
	LED1=~(i>>8);  //高位元組輸出
        Delay_ms(100); //延時
        i=i >> 1 ;     //資料右移 
      }
  }
}