/************* 3_42.c ********************************
*動作：令LED來回輸出霹靂燈，不斷的循環
*硬體：SW1-3(P0LED)ON
***********************************************/
#include "..\MPC82.H"  //暫存器及組態設定
main()
{
 unsigned char  j=0x01;  //輸出值 
  char  i;       //計數
  P0M0=0; P0M1=0xFF; //設定P0為推挽式輸出(M0-1=01)
  for(  ;  ; )   //不斷的循環執行 
  {
    for (i=1;i<8;i++)  //左移7次 
     {
       LED=~j;    //變數j由LED輸出
       Delay_ms(100);  //延時
       j=j<<1;  //變數j左移1 bit
     }
    for (i=1;i<8;i++)  //右移7次
     {
       LED=~j;    //變數j由LED輸出
       Delay_ms(100);  //延時
       j=j>>1;  //變數j右移1 bit
     }
  }
}