/************** DAC2.C *************************
*動作：由P0輸出三角函數資料送到DAC輸出正弦波
**********************************************/
#include "..\MPC82.H"   //暫存器及組態定義
#include <math.h> //將算數函數包括進來
float x,y; //正弦值計算
int i;   //角度
main()
{
  while(1)  //重覆執行 
   {
     for(i=0;i<360;i++)       //角度0~359度
      {
        x=sin(i*3.14159/180);//角度轉為弧度-1~0~1
        P0=x*127+128;        //弧度-1~0~1轉為1~128~255輸出
	    
		y=cos(i*3.14159/180);//角度轉為弧度-1~0~1
        P1=y*127+128;        //弧度-1~0~1轉為1~128~255輸出

      }
   }
}