/********** UART4A.c ********MODE1串列中斷接收****************
*動作：電腦UART送出字元，由RXD腳以中斷接收，來切換點矩陣LED字型
*硬體：SW1-2(LED8X8)、SW3-3(TxD1)及SW3-4(RxD1)ON
*操作：在超級終端機輸入0~3鍵，來切換點矩陣LED字型
***********************************************************/
#include "..\MPC82.H"   //暫存器及組態定義
#include "font4.h"  //字型ABCD資料檔
char word;  //選擇字元
main()
{
  unsigned char i;      //定義陣列資料計數
  Scan=0x7F; //由com1開始掃瞄 
 
  UART_init(9600); //設定串列環境及鮑率
  EA=1;ES=1;  //致能串列中斷
  while(1)   
   {
    for(i=0;i<8;i++) //讀取8筆資料掃瞄8次
     {
       Data=font4[word*8+i]; //讀取陣列資料
       Delay_ms(1);    //延時
	   Data=0xFF;     //全暗    
       Scan=RR8(Scan); //換掃瞄下一行
     }  
   }
}
//**************************************************
void SCON_int (void)  interrupt 4  //串列中斷函數 
 {
   if(RI==1)
   {
    RI=0;     //接收完畢，令RI=0
    word=SBUF-'0';  //將接收到的字元由P0輸出
    SBUF=word+'0';	 //發射
   }
   else TI=0;
 }
/***********************************************************
*函數名稱: UART_init
*功能描述: UART啟始程式
*輸入參數：bps
************************************************************/
void UART_init(unsigned int bps)  //UART啟始程式
{  
   P0M0=0; P0M1=0xFF; //設定P0為推挽式輸出(M0-1=01)
   SCON=0x50;     //設定UART串列傳輸為MODE1及致能接收
   TMOD=0x20;     //設定TIMER1為MODE2
   TH1=256-(57600/bps);  //設計時器決定串列傳輸鮑率
   TR1=1;          //開始計時
}