/************** 3_34.c **********************************
*動作：令LED來回輸出霹靂燈，不斷的循環
*硬體：SW1-3(P0LED)ON
*****************************************************/
#include "..\MPC82.H"  //暫存器及組態設定
main()
{
 unsigned char i=0x01;    //i=0x01
 P0M0=0; P0M1=0xFF; //設定P0為推挽式輸出(M0-1=01)
 while (1)   //不斷的循環
  {
    i=0x01;          //i=0x01
	while (i<0x80)   //繼續左移到i=0x08
     {
       LED=i; Delay_ms(100);  
       i=i<<1 ;    //左移1-bit
     }
   while (i>0x01)   //繼續右移到i=0x01
     {
       LED=i; Delay_ms(100);   
       i=i>>1 ;   //右移1-bit
     }
  }
}