/************** 3_38.c *************************
*動作：LED遞加輸出，若按下KEY1~KEY4則自我空轉
*硬體：SW1-3(P0LED)ON, 按KEY1~KEY4則LED停止
***********************************************/
#include "..\MPC82.H"  //暫存器及組態設定
main()
{
 unsigned char i=0;
 P0M0=0; P0M1=0xFF; //設定P0為推挽式輸出(M0-1=01)
 while(1)      //不斷的循環
  {
     while(KEY1==0); //按KEY1(P32)自我空轉
     while(KEY2==0); //按KEY2(P33)自我空轉
     while(KEY3==0); //按KEY3(P43)自我空轉(軟體模擬無效)
     while(KEY4==0); //按KEY4(P42)自我空轉(軟體模擬無效)
     LED=~i++;       //遞加輸出
     Delay_ms(100);  //延時
  }
}