/************* 3_43.c*************************
*動作：令LED來回輸出7次
*硬體：SW1-3(P0LED)ON
**********************************************/
#include "..\MPC82.H"  //暫存器及組態設定
main()
{
  unsigned char  j;   //輸出值
  char  i;            //計數
  P0M0=0; P0M1=0xFF; //設定P0為推挽式輸出(M0-1=01)
  for(i=1;i<=7;i++)   //LED來回輸出7次
   {
     for(j=0x01;j<0x80;j=j<<1) //左移到bit7=1
      {
        LED=~j;         //變數j由LED輸出
	Delay_ms(100); //延時
      }
     for(j=0x80;j>0x01;j=j>>1)//右移到bit0=1
      {
        LED=~j;         //變數j由LED輸出
	Delay_ms(100); //延時
      }
     }
  for(  ;  ; );    //自我空轉
}